HSO WE/WE flows/Data/Request/ISF/createorderevent_Shipped.txt

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xs="http://www.w3.org/2001/XMLSchema">
  <soapenv:Body>
<ns0:CreateOrderEventRequest xmlns:ns0="http://services.tmobile.com/oe" languageCode="en-US">
			<eventSummary xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://services.tmobile.com/oe" xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/">
				<eventType>{{eventType}}</eventType>
				<eventDateTime>2017-08-07T14:11:53</eventDateTime>
				<notificationList/>
			</eventSummary>
			<orderList xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://services.tmobile.com/oe" xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/">
				<order>
					<orderSummary>
						<ban>{{BAN}}</ban>
						<msisdn>{{MSISDN}}</msisdn>
						<channel>12</channel>
						<storeId>{{storeId}}</storeId>
						<originalSystemId>STRE</originalSystemId>
						<orderNumber>{{orderId}}</orderNumber>
						<sapOrderNumber>7000207321</sapOrderNumber>
						<orderStatus>{{orderStatus_SS}}</orderStatus>
						<orderType>ZW01</orderType>
						<orderDateTime>2017-08-07T14:11:52</orderDateTime>
						<shippingDate>2017-08-07T14:11:52</shippingDate>
						<orderItem>
							<msisdn>{{MSISDN}}</msisdn>
							<description>SAM N920T NOTE 5 32G BLK KIT</description>
							<itemType>DATK</itemType>
							<sku>{{def_sku}}</sku>
							<quantity>1.000 </quantity>
							
							<imeiBlockIndicator>A</imeiBlockIndicator>
							<suppressCustomerNotification>false</suppressCustomerNotification>
							<defectiveSKU>{{def_sku}}</defectiveSKU>
							<defectiveSKUDescription>SAM N920T NOTE 5 32G BLK KIT</defectiveSKUDescription>
							<defectiveIMEI>{{imei}}</defectiveIMEI>
						</orderItem>
						<orderDelivery>
							<trackingNumber>1Z3V891F0226409465</trackingNumber>
							<contactInfo/>
						</orderDelivery>
						<comments>Shipped On 2017-08-07 UPS2D Tracking # 1Z3V891F0226409465 Store = 451</comments>
					</orderSummary>
					<orderShipToAddress>
						<name>TM - SUPERMALL</name>
						<addressLine1>1101 SUPERMALL WAY STE 1317</addressLine1>
						<city>AUBURN</city>
						<zipcode>98001-6526</zipcode>
						<state>WA</state>
						<shippingMethod>04</shippingMethod>
					</orderShipToAddress>
					<orderBillToAddress>
						<name>TOBY KENOBI</name>
						<addressLine1>1101 Outlet Collection Way Ste 1317</addressLine1>
						<city>Auburn</city>
						<zipcode>30346</zipcode>
						<state>{{billingState}}</state>
					</orderBillToAddress>
				</order>
			</orderList>
	</ns0:CreateOrderEventRequest>
	</soapenv:Body>
</soapenv:Envelope>